//****************************包含头文件**************************//
#include "../include/Interface.h"
#include "../AppMain.h"
#include "Timer.h"
#include "../Util/Util.h"


//*****************************宏定义*****************************//

//**************************全局变量定义**************************//

//**************************全局变量申明**************************//

//****************************函数申明****************************//


void TCTask(void *pv)
{
    //无限循环
    while(1)
    {
        MyDelay(TIMER_UNIT_MS);
        g_TimerMngr.CountAndCheck();
    }    
}




