/**====*====*====*====*====*====*====*====*====*====*====*====*====*====*====*

da.c

*====*====*====*====*====*====*====*====*====*====*====*====*====*====*====*/

#include "dac.h"

//======================================================================
//功能：	完成对两个D/A的初始化
//最后编写时间：2006年3月21日
//======================================================================
void DacInit(void)
{
    APMC_PCER = 0x00060000;  //打开DAC_0和DAC_1的外部时钟
    DAC0_CR = 0x00000001;   //DAC_0 RESET
    DAC0_IDR = 0x00000001;  //关闭DAC_0的中断使能
    DAC0_MR = 0x00000010;  //设置D/A输出精度为8bit，触发为one main Clock cycle later
    DAC1_CR = 0x00000001;   //DAC_1 RESET
    DAC1_IDR = 0x00000001;  //关闭DAC_1的中断使能
    DAC1_MR = 0x00000010;  //设置D/A输出精度为8bit，触发为one main Clock cycle later
    
}

//======================================================================
//功能：	完成 DAC_0 输出
//最后编写时间：2006年3月21日
//输入：        da_output -> 欲输出电平的对应数值。
//======================================================================
void Dac0Exe(USHORT usDataOut)
{
    DAC0_DHR = usDataOut;  //数据送入数据保持寄存器，由CPU自动转换
}

//======================================================================
//功能：	完成 DAC_1 输出
//最后编写时间：2006年3月21日
//输入：        da_output -> 欲输出电平的对应数值。
//======================================================================
void Dac1Exe(USHORT usDataOut)
{
    DAC1_DHR = usDataOut;  //数据送入数据保持寄存器，由CPU自动转换
}

